[
    {
       "image":"images/projects/chatbot.png",
       "title":"Chat Bot - Conversational assistant",
       "content":"The project is a showcase of artificial intelligence and natural language processing. It contains a chatbot model that is trained to recognize the intents of users and respond correctly. Bot understands greetings and goodbyes as well as user moods and will respond accordingly.",
       "url" : "https://github.com/IgorJonjic/LogicLaneBot"
    },
    {
       "image":"images/projects/NN.webp",
       "title":"Educational Neural Network",
       "content":"ToNNi is an educational neural network developed completely from scratch by our team. Its purpose is to be used in teaching young developers the basics of neural nets and their inner workings. Its simplicity and easy-to-understand infrastructure make it stand out from bigger commercial frameworks.",
       "url" : "https://gitlab.com/big-projects1/cabininthewoodsnetwork"
      },
      {
         "image":"images/projects/pose-detection.png",
         "title":"Pose Tracking - Workout helper",
         "content":"Algorithm detects key points on the human body and with application of mathematical methods tracks the number of repetitions for a given exercise. It is also able to track if those exercises were performed with full range of motion. Exercises covered so far are pullups, pushups and squats.",
         "url" : "https://github.com/m-soldo/mediapipe_exercise"
      },
    {
       "image":"images/projects/text-classification.png",
       "title":"Text Classification",
       "content":"The project contains three different classification algorithms that were used on an e-commerce dataset downloaded from Kaggle.com. The dataset is edited as a csv file and contains two columns with text describing the product and the corresponding class. Algorithms are rated according to accuracy and a confusion matrix is presented for each algorithm.",
       "url" : "https://github.com/IgorJonjic/Comparing-Text-Classification-algorithms"
    },
    {
      "image":"images/projects/text-summarization.png",
      "title":"Large Document Summarization",
      "content":"This model takes large documents such as scientific papers, big essays and newspaper articles and condenses them to a smaller number of sentences set by the user. This tool is helpful for analyzing big amounts of data that would take a long time to be processed by a human",
      "url" : "https://github.com/dvorel/text_summarization"
   }
 ]
